{
    "projects":[
        
        {
            "name": "Pavlov Horde Website",
            "url":"https://pavlovhorde.com/",
            "description":"A Web App for Viewing and Managing dedicated Servers for Pavlov VR, the most popular Virtual Reality shooter, a clone of Counter-Strike (CS:GO) with an estimated 50,000 active players. Allows users to buy (via Stripe) dedicated servers for managing custom games, maps, skins, passwords, items, banlists and much more. The Web App allows Sign Up, Subscription Payment Management, Game Statistics, Server Viewing, Remote Connection, a Maps Database and Direct Server Management. Servers are bought via Stripe Payments which triggers the creation of a VULTR hosted, Ubuntu server with all necessary software, exposed via a Node JS API to allow direct server management.",
            "keywords":"Revenue Generating, React, Node, Express API, PostgreSQL, Quest, Pavlov VR",
            "logo":"https://pavlovhorde.com/static/PHorde2-0f28d87f6d78c882bb2061c2ab9d5f67.png",
            "gitUrl": "https://github.com/khanchingghis/horde"
        },
        {
            "name": "Pavlov Horde Service",
            "url":"https://pavlovhorde.com/buy",
            "description":"The Horde Service at its core is a suite of backend microservices installed onto an Ubuntu VULTR server, managed centrally by a separate, dedicated Node JS API. The Horde API is called from the Frontend Web App and Discord Bots by paying customers to manage their server. On completion of a successful payment via Stripe, a new Ubuntu server is launched with all necessary services and exposed via a Node JS Express API. User details, server options, activity logs, and game statistics are stored in a PostgreSQL database and retreived/written by the Horde API. Game player performance statistics are polled from the server and stored in the database for analysis and scoring via the Web App.",
            "keywords":"Express API, Node, PostgreSQL, VULTR, Linux Bash, Pavlov VR",
            "logo":"https://pavlovhorde.com/static/PHorde3gold-1eb6238d469aa4769a8e0bce07300eab.png",
            "gitUrl":"https://github.com/khanchingghis/horde"
        },
        {
            "name": "Portfolio Website",
            "url":"https://olibn.com/",
            "description":"This Portfolio Website, built using React JS and the Material UI Components. A canvas element was used with JavaScript physics for the background 'Collision Node Garden' effect.",
            "keywords":"React, Material UI, Canvas, JavaScript, HTML, CSS",
            "logo":"OBN",
            "gitUrl":"https://github.com/olibn333/portfolio"
        },
        {
            "name":"Corporate Client API Integrations",
            "url":"Private",
            "description":"A suite of 37 Customised Excel Add-Ins and Node JS Express APIs, auto-updating and maintained across a client base of 37 corporate customers. When working with corporate customers for a digital payments company, each client needs customised reports from the core database ledger. Some require a direct custom API for the custom data, others require offline Excel formatting Add-Ins that allow 1-to-1 mapping of local IDs to Partner IDs, uploading to the payment/invoicing service, and payment status retrieval.",
            "keywords":"Revenue Generating, Node, Express, Git, VBA, Excel",
            "logo":"https://upload.wikimedia.org/wikipedia/commons/d/da/Microsoft_Excel_2013_logo_with_background.png",
            "gitUrl":"Private"
        },
        {
            "name":"MVR Website",
            "url": "http://myanmarvr.com/",
            "description":"Promotional base for Myanmar Virtual Reality advisory & creative business",
            "keywords":"JavaScript, HTML, CSS, Parallax, VR",
            "logo":"MVRWebsite",
            "gitUrl":""
        },
        {
            "name":"MVR Power Service",
            "url": "myanmarvr.com",
            "description":"Power Cuts are common in Myanmar. MVR Power allows paying customers to install a cheap ($20) android device in their home or office that remotely monitors power outages and remotely writes changes to a central MySQL database. The Power Status can then be viewed via the Web Dashboard showing a list of active devices and a map of the city. Email notifications are sent when there is a power outage and return, allowing users to judge when to return home and enjoy modern luxuries such as aircon and TV",
            "keywords":"Revenue Generating, Java, Android, PHP, JavaScript",
            "logo":"http://myanmarvr.com/img/MVR%20Logo.png",
            "gitUrl":"https://github.com/olibn333/MVR-Power"
        }
    ]
}